docs/ex-distribution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-03 Fri 05:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO Example - Distribution</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO Example - Distribution</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f6203b">1. Quick start</a></li>
<li><a href="#org37db13f">2. Exploring</a></li>
<li><a href="#org9ef28fa">3. Going further</a>
<ul>
<li><a href="#org53b44e1">3.1. Threaded actors</a></li>
<li><a href="#orgafb9df2">3.2. Hybrid topology</a></li>
<li><a href="#org30a3fae">3.3. Multi-hosted demo</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="examples.html">Examples</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
ZIO provides a program <code>check-pubsub</code>.  With various instances of this
one program you may:
</p>

<ul class="org-ul">
<li>construct an arbitrary network topology consisting of a number of
<b>roles</b> which are categorized as <b>source</b>, <b>sink</b> or <b>proxy</b>.  A
source generates messages and sink consumes them.  A proxy recvs
messages and resends them.</li>

<li>each role may utilize multiple sockets to emulate multiple
instances of a role.  For example a source with 10 sockets emulates
10 sources with 1 socket.</li>

<li>each role periodically emits a rate measure which can be used to
benchmark different topology and physical networks.</li>

<li>network topology is quasi-self-organizing as links may be described
using abstract node and port names.</li>

<li>Both PUB/SUB and PUSH/PULL links are supported to allow easy
evaluation of their technical trade-offs.</li>

<li>behavior of <code>check-pubsub</code> is highly configurable and a number of
<b>configuration models</b> are provided as starting points.</li>
</ul>

<div id="outline-container-org2f6203b" class="outline-2">
<h2 id="org2f6203b"><span class="section-number-2">1</span> Quick start</h2>
<div class="outline-text-2" id="text-1">
<p>
Here you will generate JSON configuration file for <code>check-pubsub</code> and
then run two instances of the program, one <b>source</b> with 10 PUB
sockets and one <b>sink</b> with 10 SUB sockets.  Every SUB will connect to
every PUB by using ZIO discovery.  
</p>

<pre class="example">
$ waf install
$ mkdir junk &amp;&amp; cd junk
$ ../test/check-pubsub-gencfg.sh
$ ../scripts/shoreman Procfile.many2many
...
11:26:49 sink	| [2020-04-02 11:26:49.011] [console] [info] sink: rate: 46.1681 kHz, &lt;46.3631&gt; kHz
11:26:49 source	| [2020-04-02 11:26:49.990] [console] [info] source: rate: 4.6374 kHz, &lt;4.6374&gt; kHz
...
Ctrl-c
</pre>

<p>
In this example, messages were generated at 500 Hz, each message is
separately sent out to each of the 10 PUB sockets of the <b>source</b>
(aggregate 5kHz) and each of those messages are fanned out to 10 SUB
sockets and all received in the one <b>sink</b> (aggregate of 50 kHz).
</p>

<p>
The 10x10 links can be change to 10 + 10 by inserting a <b>proxy</b>
("lightweight broker") between the PUBs and the SUBs.  The proxy has a
SUB "front end" linked to all <b>source</b> PUBs.  Each message received is
then sent out its "back end" PUB which fans out to the 10 SUBs of the
<b>sink</b>.  This can be exercised with:
</p>

<pre class="example">
$ ../scripts/shoreman Procfile.many2one2many
11:55:30 proxy	| [2020-04-02 11:55:30.289] [console] [info] proxy: rate: 4.7529 kHz, &lt;4.7529&gt; kHz
11:55:30 source	| [2020-04-02 11:55:30.289] [console] [info] source: rate: 4.7547 kHz, &lt;4.7547&gt; kHz
11:55:30 sink	| [2020-04-02 11:55:30.289] [console] [info] sink: rate: 47.6190 kHz, &lt;47.5421&gt; kHz
</pre>

<p>
As before the (approx) 500 Hz of generation of messages is amplified
by 10x out of the <b>source</b> (5kHz).  The <b>proxy</b> sees and forwards this
rate and another 10x implication occurs by its PUB socket so the
<b>sink</b> sees an aggregate 50 kHz.
</p>
</div>
</div>

<div id="outline-container-org37db13f" class="outline-2">
<h2 id="org37db13f"><span class="section-number-2">2</span> Exploring</h2>
<div class="outline-text-2" id="text-2">
<p>
The single <code>check-pubsub.jsonnet</code> <b>configuration model</b> file generates
all these demo JSON files.  One may play with it and rerun the
<code>check-pubsub-gencfg.sh</code> to refresh the JSON files (or make new ones).
Toward the top of the file are a number of parameters that can be
modified with out looking deeper at the data structure.  They are
described:
</p>

<dl class="org-dl">
<dt><code>rate</code></dt><dd>Sets the rate of message generation in Hz.  This is the rate
before any amplification (see example in <a href="#org2f6203b">1</a>).
This is an approximate rate which translates into a sleep
which at best millisecond resolution.  Beyond about 500 Hz,
the code will simply free run.</dd>

<dt><code>msize</code></dt><dd>Sets the message size in bytes.</dd>

<dt><code>nchirp</code></dt><dd>Sets the frequency of emitting message given in terms of
the number of messages output.  Eg, if a source has 10
output sockets and a <code>rate = 500</code> then <code>nchirp = 5000</code>
produces approximately 1 Hz of rate messages.</dd>

<dt><code>give_sock</code></dt><dd>Sets the socket type for output.  It may be "PUB" or
"PUSH".  See notes below</dd>
<dt><code>take_sock</code></dt><dd>Sets the socket type for input.  It may be "SUB" or
"PULL".  See notes below</dd>

<dt><code>bind_addr</code></dt><dd>Set an IP address for any sockets that will <code>bind()</code>.
Eg, may set to "127.0.0.1" for local testing or an
external NIC for testing across a network.</dd>
</dl>

<p>
Notes on sockets: Links between PUB/SUB and those between PUSH/PULL
differ in important ways:
</p>

<ul class="org-ul">
<li>PUB/SUB is subject to message loss if downstream can not keep up</li>
<li>PUSH/PULL is subject to back pressure causing upstream to wait if downstream can not keep up</li>

<li>PUB fans out to all SUBs</li>
<li>PUSH sends round-robin to all PULLs</li>
</ul>

<p>
These features must be taken into account when interpreting rates.
</p>
</div>
</div>

<div id="outline-container-org9ef28fa" class="outline-2">
<h2 id="org9ef28fa"><span class="section-number-2">3</span> Going further</h2>
<div class="outline-text-2" id="text-3">
<p>
Some places to take this demo further are describe.  The first entail
updating the C++ code of <code>check-pubsub</code> and the remaining involve
developing the <b>configuration model</b> further.
</p>
</div>

<div id="outline-container-org53b44e1" class="outline-3">
<h3 id="org53b44e1"><span class="section-number-3">3.1</span> Threaded actors</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Currently, only one role per instance of <code>check-pubsub</code> is supported
and it runs in a single thread.  This means that, eg, a <b>source</b> with
10 sockets sends 10 message to each in term before sleeping by the
inverse of the requested rate.  This explains why the observed rate is
less than "10x500 Hz".  
</p>

<p>
For very high rates, this single thread will become starved and a
maximum source rate will be hit.  Downstream roles may likewise be
starved which may either lead to dropped messages (PUB/SUB) or causing
downstream to wait (PUSH/PULL).
</p>
</div>
</div>

<div id="outline-container-orgafb9df2" class="outline-3">
<h3 id="orgafb9df2"><span class="section-number-3">3.2</span> Hybrid topology</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The current <b>configuration model</b> only supports homogeneous choice of
PUB/SUB or PUSH/PULL.  Different use cases might be emulated.  For
example a <b>proxy</b> may have a SUB on input and a PUSH on output in
order to spread the load of downstream message processing.
</p>
</div>
</div>

<div id="outline-container-org30a3fae" class="outline-3">
<h3 id="org30a3fae"><span class="section-number-3">3.3</span> Multi-hosted demo</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The current <b>configuration model</b> only supports having all <code>bind()</code>
sockets be on one host while <code>connect()</code> sockets may be on any
depending one where the <b>role</b> is executed.  Extending the model to
let <code>bind()</code> be ephemeral (automagically pick both the NIC and the IP
port number) would allow a demo across many hosts.  ZIO supports this,
one need simply bind with an "address" which is the empty string.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
